eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеСтатейЗатрат/абсСогласованиеСтатейЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсСогласованиеСтатейЗатрат</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательДопСогласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДопСогласования</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНоменклатуры/абс_СтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНоменклатуры</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласование</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеСтатейЗатрат/ObjectModule.bsl
Процедура УсловиеУтвержденНДСПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = СтатьяЗатрат.абс_СтатусСтатьиЗатрат = Перечисления.абс_СтатусыНоменклатуры.Использование;
	
КонецПроцедуры

Процедура ОткрытьСтатьюЗатрат()
	
	ФормаСтатьиЗатрат = СтатьяЗатрат.ПолучитьФорму("ФормаЭлемента");
	
	Если ФормаСтатьиЗатрат.Открыта() Тогда
		ФормаСтатьиЗатрат.Активизировать();
	Иначе
		ФормаСтатьиЗатрат.Открыть();
	КонецЕсли;
	
КонецПроцедуры

// ПРОЦЕДУРЫ ОБРАБОТЧКИ ПриИнтеррактивнойАктивизации

Процедура ДействиеУтверждениеГруппойНСИОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьСтатьюЗатрат();
	
КонецПроцедуры

Процедура ДействиеСтатьяЗатратУтвержденаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьСтатьюЗатрат();
	
КонецПроцедуры

Процедура ДействиеОтказаноВСогласованииОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьСтатьюЗатрат();
	
КонецПроцедуры

Процедура ДействиеСтатьяЗатратУтвержденаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
	//
	НоваяЗадача.Наименование = СокрЛП(СтатьяЗатрат.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= СтатьяЗатрат;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);	
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СтатьяЗатрат, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, СтатьяЗатрат.абс_СтатусСтатьиЗатрат);

КонецПроцедуры

Процедура ДействиеОтказаноВСогласованииПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
			
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
	//
	НоваяЗадача.Наименование = СокрЛП(СтатьяЗатрат.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= СтатьяЗатрат;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СтатьяЗатрат, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, СтатьяЗатрат.абс_СтатусСтатьиЗатрат);

КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ,РольИсполнителей)
	
	ФормируемыеЗадачи.Очистить();
	
	ЗапросИсполнителей = Новый Запрос("ВЫБРАТЬ
									  |	РолиИИсполнители.Исполнитель
									  |ИЗ
									  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
									  |ГДЕ
									  |	РолиИИсполнители.Роль = &РольИсполнителей");
									  
	//РольИсполнителей = Неопределено;									  
	//Если ТочкаМаршрута = БизнесПроцессы.абсСогласованиеСтатейЗатрат.ТочкиМаршрута.ДействиеУтверждениеГруппойНСИ Тогда
	//	мРольИсполнителей = Справочники.РолиИсполнителей.СотрудникГруппыНСИ;
	//Иначе
	//	мРольИсполнителей = РольИсполнителей;
	//КонецЕсли;
	//
	//Если РольИсполнителей = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	//
	Если ВыборкаИсполнителей.Количество() > 0 Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
		НоваяЗадача.Дата 				= ТекущаяДата();
	
		НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.СтатьяЗатрат);
		
		НоваяЗадача.Наименование = СокрЛП(СтатьяЗатрат.Наименование) + " "  
			+ ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		//НоваяЗадача.Исполнитель			= ВыборкаИсполнителей.Исполнитель;
		
		НоваяЗадача.ОбъектЗадачи 		= СтатьяЗатрат;
		НоваяЗадача.Роль                = РольИсполнителей;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	Иначе 
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных.", Отказ);
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СтатьяЗатрат, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура ДействиеУтверждениеГруппойНСИПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
//АБС ВСТАВКА 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ,Справочники.РолиИсполнителей.СотрудникГруппыНСИ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, СтатьяЗатрат.абс_СтатусСтатьиЗатрат);	
	
КонецПроцедуры

Процедура ВыборВариантаОтправитьНаСогласованиеОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусСтатьиЗатрат = СтатьяЗатрат.абс_СтатусСтатьиЗатрат; 
	
	Если ТекСтатусСтатьиЗатрат = Перечисления.абс_СтатусыНоменклатуры.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатусСтатьиЗатрат = Перечисления.абс_СтатусыНоменклатуры.ДопСогласование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантДопСогласование;
	ИначеЕсли ТекСтатусСтатьиЗатрат = Перечисления.абс_СтатусыНоменклатуры.Использование Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантИспользование;
    КонецЕсли;
КонецПроцедуры

Процедура ДействиеДополнительноеСогласованиеОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	ОткрытьСтатьюЗатрат();

КонецПроцедуры

Процедура ДействиеДополнительноеСогласованиеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
		
	ФормируемыеЗадачи.Очистить();	
	
	
	Если ЗначениеЗаполнено(ПользовательДопСогласование) Тогда
			абс_БизнесПроцессы.СформироватьЗадачуСогласованиеСтатейЗатрат(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, 
				ПользовательДопСогласование, Отказ);
	КонецЕсли;
		
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач на дополнительное согласование. Не найден ответственный.", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СтатьяЗатрат, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);		
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, СтатьяЗатрат.абс_СтатусСтатьиЗатрат);
	
КонецПроцедуры

Процедура ПовторнаяПодготовкаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи.Очистить();	
	
	
	Если ЗначениеЗаполнено(СтатьяЗатрат.абс_Ответственный) Тогда
			абс_БизнесПроцессы.СформироватьЗадачуСогласованиеСтатейЗатрат(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, 
				СтатьяЗатрат.абс_Ответственный, Отказ);
	КонецЕсли;
		
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач на дополнительное согласование. Не найден ответственный.", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СтатьяЗатрат, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);		
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, СтатьяЗатрат.абс_СтатусСтатьиЗатрат);
КонецПроцедуры

Процедура ОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи.Очистить();	
	
	
	Если ЗначениеЗаполнено(СтатьяЗатрат.абс_Ответственный) Тогда
			абс_БизнесПроцессы.СформироватьЗадачуСогласованиеСтатейЗатрат(ЭтотОбъект.Ссылка, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, 
				СтатьяЗатрат.абс_Ответственный, Отказ);
	КонецЕсли;
		
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании задач на дополнительное согласование. Не найден ответственный.", Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, СтатьяЗатрат, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);		
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, СтатьяЗатрат.абс_СтатусСтатьиЗатрат);
КонецПроцедуры
